wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
/* stm32wb_aes.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfHAL.
 *
 * wolfHAL is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfHAL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include <stdint.h>
#include "wolfHAL_board.h"  /* provides WHAL_CFG_STM32WB_AES*_DEV initializers */
#include <wolfHAL/crypto/stm32wb_aes.h>
#include <wolfHAL/crypto/crypto.h>
#include <wolfHAL/error.h>
#include <wolfHAL/reg.h>
#include <wolfHAL/bitops.h>
#include <wolfHAL/endian.h>

/* Mutable state buffers for GCM/CCM streaming sessions. Internal linkage —
 * referenced only by the AesGcm/AesCcm singletons below. */
static whal_Stm32wb_AesGcm_State g_stm32wbAesGcmDevState;
static whal_Stm32wb_AesCcm_State g_stm32wbAesCcmDevState;

const whal_Crypto  whal_Stm32wb_Aes_Dev      = WHAL_CFG_STM32WB_AES_DEV;
const whal_AesEcb  whal_Stm32wb_AesEcb_Dev   = WHAL_CFG_STM32WB_AES_ECB_DEV;
const whal_AesCbc  whal_Stm32wb_AesCbc_Dev   = WHAL_CFG_STM32WB_AES_CBC_DEV;
const whal_AesCtr  whal_Stm32wb_AesCtr_Dev   = WHAL_CFG_STM32WB_AES_CTR_DEV;
const whal_AesGcm  whal_Stm32wb_AesGcm_Dev   = WHAL_CFG_STM32WB_AES_GCM_DEV;
const whal_AesGmac whal_Stm32wb_AesGmac_Dev  = WHAL_CFG_STM32WB_AES_GMAC_DEV;
const whal_AesCcm  whal_Stm32wb_AesCcm_Dev   = WHAL_CFG_STM32WB_AES_CCM_DEV;

/* Control Register */
#define AES_CR_REG        0x00
#define AES_CR_EN_Pos     0
#define AES_CR_EN_Msk     (1UL << AES_CR_EN_Pos)

#define AES_CR_DATATYPE_Pos 1
#define AES_CR_DATATYPE_Msk (3UL << AES_CR_DATATYPE_Pos)

#define AES_CR_MODE_Pos   3
#define AES_CR_MODE_Msk   (3UL << AES_CR_MODE_Pos)

#define AES_CR_CHMOD_Pos  5
#define AES_CR_CHMOD_Msk  (3UL << AES_CR_CHMOD_Pos)

#define AES_CR_CHMOD2_Pos 16
#define AES_CR_CHMOD2_Msk (1UL << AES_CR_CHMOD2_Pos)

#define AES_CR_CCFC_Pos   7
#define AES_CR_CCFC_Msk   (1UL << AES_CR_CCFC_Pos)

#define AES_CR_KEYSIZE_Pos 18
#define AES_CR_KEYSIZE_Msk (1UL << AES_CR_KEYSIZE_Pos)

#define AES_CR_GCMPH_Pos  13
#define AES_CR_GCMPH_Msk  (3UL << AES_CR_GCMPH_Pos)

#define AES_CR_NPBLB_Pos  20
#define AES_CR_NPBLB_Msk  (0xF << AES_CR_NPBLB_Pos)

/* Status Register */
#define AES_SR_REG        0x04
#define AES_SR_CCF_Pos    0
#define AES_SR_CCF_Msk    (1UL << AES_SR_CCF_Pos)

#define AES_SR_RDERR_Pos  1
#define AES_SR_RDERR_Msk  (1UL << AES_SR_RDERR_Pos)

#define AES_SR_WRERR_Pos  2
#define AES_SR_WRERR_Msk  (1UL << AES_SR_WRERR_Pos)

/* Data Registers */
#define AES_DINR_REG      0x08
#define AES_DOUTR_REG     0x0C

/* Key Registers */
#define AES_KEYR0_REG     0x10
#define AES_KEYR1_REG     0x14
#define AES_KEYR2_REG     0x18
#define AES_KEYR3_REG     0x1C
#define AES_KEYR4_REG     0x30
#define AES_KEYR5_REG     0x34
#define AES_KEYR6_REG     0x38
#define AES_KEYR7_REG     0x3C

/* Initialization Vector Registers */
#define AES_IVR0_REG      0x20
#define AES_IVR1_REG      0x24
#define AES_IVR2_REG      0x28
#define AES_IVR3_REG      0x2C

/* Chaining modes */
#define AES_CHMOD_ECB     0x0
#define AES_CHMOD_CBC     0x1
#define AES_CHMOD_CTR     0x2
#define AES_CHMOD_GCM     0x3
#define AES_CHMOD_CCM     0x4

/* Operating modes */
#define AES_MODE_ENCRYPT  0x0
#define AES_MODE_KEYDERIV 0x1
#define AES_MODE_DECRYPT  0x2
#define AES_MODE_KEYDERIV_DECRYPT 0x3

/* Data types (swap modes) */
#define AES_DATATYPE_NONE     0x0
#define AES_DATATYPE_HALFWORD 0x1
#define AES_DATATYPE_BYTE     0x2
#define AES_DATATYPE_BIT      0x3

/* GCM phases */
#define AES_GCMPH_INIT    0x0
#define AES_GCMPH_HEADER  0x1
#define AES_GCMPH_PAYLOAD 0x2
#define AES_GCMPH_FINAL   0x3

static void WriteKey(size_t base, const uint8_t *key, size_t keySz)
{
    const uint8_t *k = key;
    if (keySz == 32) {
        whal_Reg_Write(base, AES_KEYR7_REG, whal_LoadBe32(k));
        whal_Reg_Write(base, AES_KEYR6_REG, whal_LoadBe32(k + 4));
        whal_Reg_Write(base, AES_KEYR5_REG, whal_LoadBe32(k + 8));
        whal_Reg_Write(base, AES_KEYR4_REG, whal_LoadBe32(k + 12));
        k += 16;
    }
    whal_Reg_Write(base, AES_KEYR3_REG, whal_LoadBe32(k));
    whal_Reg_Write(base, AES_KEYR2_REG, whal_LoadBe32(k + 4));
    whal_Reg_Write(base, AES_KEYR1_REG, whal_LoadBe32(k + 8));
    whal_Reg_Write(base, AES_KEYR0_REG, whal_LoadBe32(k + 12));
}

static void WriteIv(size_t base, const uint8_t *iv)
{
    whal_Reg_Write(base, AES_IVR3_REG, whal_LoadBe32(iv));
    whal_Reg_Write(base, AES_IVR2_REG, whal_LoadBe32(iv + 4));
    whal_Reg_Write(base, AES_IVR1_REG, whal_LoadBe32(iv + 8));
    whal_Reg_Write(base, AES_IVR0_REG, whal_LoadBe32(iv + 12));
}

/* Wipe key and IV/counter material from the peripheral registers. Callers must
 * clear EN first (key registers are only writable while disabled). */
static void ZeroKeyIv(size_t base)
{
    whal_Reg_Write(base, AES_KEYR7_REG, 0);
    whal_Reg_Write(base, AES_KEYR6_REG, 0);
    whal_Reg_Write(base, AES_KEYR5_REG, 0);
    whal_Reg_Write(base, AES_KEYR4_REG, 0);
    whal_Reg_Write(base, AES_KEYR3_REG, 0);
    whal_Reg_Write(base, AES_KEYR2_REG, 0);
    whal_Reg_Write(base, AES_KEYR1_REG, 0);
    whal_Reg_Write(base, AES_KEYR0_REG, 0);
    whal_Reg_Write(base, AES_IVR3_REG, 0);
    whal_Reg_Write(base, AES_IVR2_REG, 0);
    whal_Reg_Write(base, AES_IVR1_REG, 0);
    whal_Reg_Write(base, AES_IVR0_REG, 0);
}

static void WriteBlock(size_t base, const uint8_t *in)
{
    whal_Reg_Write(base, AES_DINR_REG, whal_LoadBe32(in));
    whal_Reg_Write(base, AES_DINR_REG, whal_LoadBe32(in + 4));
    whal_Reg_Write(base, AES_DINR_REG, whal_LoadBe32(in + 8));
    whal_Reg_Write(base, AES_DINR_REG, whal_LoadBe32(in + 12));
}

static void ReadBlock(size_t base, uint8_t *out)
{
    whal_StoreBe32(out,      whal_Reg_Read(base, AES_DOUTR_REG));
    whal_StoreBe32(out + 4,  whal_Reg_Read(base, AES_DOUTR_REG));
    whal_StoreBe32(out + 8,  whal_Reg_Read(base, AES_DOUTR_REG));
    whal_StoreBe32(out + 12, whal_Reg_Read(base, AES_DOUTR_REG));
}

static whal_Error WaitForCCF(size_t base, whal_Timeout *timeout)
{
    whal_Error err;
    err = whal_Reg_ReadPoll(base, AES_SR_REG, AES_SR_CCF_Msk,
                            AES_SR_CCF_Msk, timeout);
    if (err)
        return err;
    whal_Reg_Update(base, AES_CR_REG, AES_CR_CCFC_Msk, AES_CR_CCFC_Msk);
    return WHAL_SUCCESS;
}

static whal_Error ProcessBlockCipher(whal_Crypto *cryptoDev,
                                     const uint8_t *in, uint8_t *out,
                                     size_t sz)
{
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)cryptoDev->cfg;
    size_t base = cryptoDev->base;
    whal_Error err;
    size_t i;

    if (sz == 0)
        return WHAL_SUCCESS;

    if (!in || !out || (sz & 0xF) != 0) {
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

