wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
    for (i = 0; i < sz; i += 16) {
        WriteBlock(base, in + i);
        err = WaitForCCF(base, cfg->timeout);
        if (err) {
            whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
            ZeroKeyIv(base);
            return err;
        }
        ReadBlock(base, out + i);
    }

    return WHAL_SUCCESS;
}

static void DisableAes(whal_Crypto *cryptoDev)
{
    whal_Reg_Update(cryptoDev->base, AES_CR_REG, AES_CR_EN_Msk, 0);
}


/* ---- Direct API mapping ---- */

#ifdef WHAL_CFG_STM32WB_AES_INIT_DIRECT_API_MAPPING
#define whal_Stm32wb_Aes_Init       whal_Crypto_Init
#define whal_Stm32wb_Aes_Deinit     whal_Crypto_Deinit
#endif
#ifdef WHAL_CFG_STM32WB_AES_ECB_DIRECT_API_MAPPING
#define whal_Stm32wb_AesEcb_Oneshot whal_AesEcb_Oneshot
#define whal_Stm32wb_AesEcb_Start   whal_AesEcb_Start
#define whal_Stm32wb_AesEcb_Process whal_AesEcb_Process
#endif
#ifdef WHAL_CFG_STM32WB_AES_CBC_DIRECT_API_MAPPING
#define whal_Stm32wb_AesCbc_Oneshot whal_AesCbc_Oneshot
#define whal_Stm32wb_AesCbc_Start   whal_AesCbc_Start
#define whal_Stm32wb_AesCbc_Process whal_AesCbc_Process
#endif
#ifdef WHAL_CFG_STM32WB_AES_CTR_DIRECT_API_MAPPING
#define whal_Stm32wb_AesCtr_Oneshot whal_AesCtr_Oneshot
#define whal_Stm32wb_AesCtr_Start   whal_AesCtr_Start
#define whal_Stm32wb_AesCtr_Process whal_AesCtr_Process
#endif
#ifdef WHAL_CFG_STM32WB_AES_GCM_DIRECT_API_MAPPING
#define whal_Stm32wb_AesGcm_Oneshot  whal_AesGcm_Oneshot
#define whal_Stm32wb_AesGcm_Start    whal_AesGcm_Start
#define whal_Stm32wb_AesGcm_Process  whal_AesGcm_Process
#define whal_Stm32wb_AesGcm_Finalize whal_AesGcm_Finalize
#endif
#ifdef WHAL_CFG_STM32WB_AES_GMAC_DIRECT_API_MAPPING
#define whal_Stm32wb_AesGmac_Oneshot whal_AesGmac_Oneshot
#endif
#ifdef WHAL_CFG_STM32WB_AES_CCM_DIRECT_API_MAPPING
#define whal_Stm32wb_AesCcm_Oneshot  whal_AesCcm_Oneshot
#define whal_Stm32wb_AesCcm_Start    whal_AesCcm_Start
#define whal_Stm32wb_AesCcm_Process  whal_AesCcm_Process
#define whal_Stm32wb_AesCcm_Finalize whal_AesCcm_Finalize
#endif


/* ---- Init / Deinit ---- */

whal_Error whal_Stm32wb_Aes_Init(whal_Crypto *dev)
{
    (void)dev;
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wb_Aes_Deinit(whal_Crypto *dev)
{
    (void)dev;
    DisableAes((whal_Crypto *)&whal_Stm32wb_Aes_Dev);
    ZeroKeyIv(whal_Stm32wb_Aes_Dev.base);
    return WHAL_SUCCESS;
}

const whal_CryptoDriver whal_Stm32wb_Aes_CryptoDriver = {
    .Init = whal_Stm32wb_Aes_Init,
    .Deinit = whal_Stm32wb_Aes_Deinit,
};


/* ---- AES-ECB ---- */

whal_Error whal_Stm32wb_AesEcb_Oneshot(whal_AesEcb *dev, whal_Crypto_Dir dir,
                              const void *key, size_t keySz,
                              const void *in, void *out, size_t sz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesEcb_Dev.crypto;
    size_t base = crypto->base;
    size_t mode;
    size_t keySizeBit;
    whal_Error err;

    (void)dev;

    if (!key)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    keySizeBit = (keySz == 32) ? 1 : 0;
    mode = (dir == WHAL_CRYPTO_ENCRYPT)
        ? AES_MODE_ENCRYPT : AES_MODE_KEYDERIV_DECRYPT;

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos, mode) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_ECB) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit));

    WriteKey(base, key, keySz);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    err = ProcessBlockCipher(crypto, in, out, sz);
    DisableAes(crypto);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32wb_AesEcb_Start(whal_AesEcb *dev, whal_Crypto_Dir dir,
                            const void *key, size_t keySz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesEcb_Dev.crypto;
    size_t base = crypto->base;
    size_t mode;
    size_t keySizeBit;

    (void)dev;

    if (!key)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    keySizeBit = (keySz == 32) ? 1 : 0;
    mode = (dir == WHAL_CRYPTO_ENCRYPT)
        ? AES_MODE_ENCRYPT : AES_MODE_KEYDERIV_DECRYPT;

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos, mode) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_ECB) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit));

    WriteKey(base, key, keySz);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wb_AesEcb_Process(whal_AesEcb *dev,
                              const void *in, void *out, size_t sz)
{
    (void)dev;
    return ProcessBlockCipher(whal_Stm32wb_AesEcb_Dev.crypto, in, out, sz);
}

const whal_AesEcbDriver whal_Stm32wb_Aes_EcbDriver = {
    .Oneshot = whal_Stm32wb_AesEcb_Oneshot,
    .Start = whal_Stm32wb_AesEcb_Start,
    .Process = whal_Stm32wb_AesEcb_Process,
};


/* ---- AES-CBC ---- */

whal_Error whal_Stm32wb_AesCbc_Oneshot(whal_AesCbc *dev, whal_Crypto_Dir dir,
                              const void *key, size_t keySz,
                              const void *iv,
                              const void *in, void *out, size_t sz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCbc_Dev.crypto;
    size_t base = crypto->base;
    size_t mode;
    size_t keySizeBit;
    whal_Error err;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

