wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
    keySizeBit = (keySz == 32) ? 1 : 0;
    mode = (dir == WHAL_CRYPTO_ENCRYPT)
        ? AES_MODE_ENCRYPT : AES_MODE_KEYDERIV_DECRYPT;

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos, mode) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_CBC) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit));

    WriteKey(base, key, keySz);
    WriteIv(base, iv);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    err = ProcessBlockCipher(crypto, in, out, sz);
    DisableAes(crypto);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32wb_AesCbc_Start(whal_AesCbc *dev, whal_Crypto_Dir dir,
                            const void *key, size_t keySz,
                            const void *iv)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCbc_Dev.crypto;
    size_t base = crypto->base;
    size_t mode;
    size_t keySizeBit;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    keySizeBit = (keySz == 32) ? 1 : 0;
    mode = (dir == WHAL_CRYPTO_ENCRYPT)
        ? AES_MODE_ENCRYPT : AES_MODE_KEYDERIV_DECRYPT;

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos, mode) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_CBC) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit));

    WriteKey(base, key, keySz);
    WriteIv(base, iv);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wb_AesCbc_Process(whal_AesCbc *dev,
                              const void *in, void *out, size_t sz)
{
    (void)dev;
    return ProcessBlockCipher(whal_Stm32wb_AesCbc_Dev.crypto, in, out, sz);
}

const whal_AesCbcDriver whal_Stm32wb_Aes_CbcDriver = {
    .Oneshot = whal_Stm32wb_AesCbc_Oneshot,
    .Start = whal_Stm32wb_AesCbc_Start,
    .Process = whal_Stm32wb_AesCbc_Process,
};


/* ---- AES-CTR ---- */

whal_Error whal_Stm32wb_AesCtr_Oneshot(whal_AesCtr *dev, whal_Crypto_Dir dir,
                              const void *key, size_t keySz,
                              const void *iv,
                              const void *in, void *out, size_t sz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCtr_Dev.crypto;
    size_t base = crypto->base;
    size_t keySizeBit;
    whal_Error err;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    keySizeBit = (keySz == 32) ? 1 : 0;

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_CTR) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit));

    WriteKey(base, key, keySz);
    WriteIv(base, iv);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    err = ProcessBlockCipher(crypto, in, out, sz);
    DisableAes(crypto);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32wb_AesCtr_Start(whal_AesCtr *dev, whal_Crypto_Dir dir,
                            const void *key, size_t keySz,
                            const void *iv)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCtr_Dev.crypto;
    size_t base = crypto->base;
    size_t keySizeBit;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    keySizeBit = (keySz == 32) ? 1 : 0;

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_CTR) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit));

    WriteKey(base, key, keySz);
    WriteIv(base, iv);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wb_AesCtr_Process(whal_AesCtr *dev,
                              const void *in, void *out, size_t sz)
{
    (void)dev;
    return ProcessBlockCipher(whal_Stm32wb_AesCtr_Dev.crypto, in, out, sz);
}

const whal_AesCtrDriver whal_Stm32wb_Aes_CtrDriver = {
    .Oneshot = whal_Stm32wb_AesCtr_Oneshot,
    .Start = whal_Stm32wb_AesCtr_Start,
    .Process = whal_Stm32wb_AesCtr_Process,
};


/* ---- AES-GCM ---- */

whal_Error whal_Stm32wb_AesGcm_Oneshot(whal_AesGcm *dev, whal_Crypto_Dir dir,
                              const void *key, size_t keySz,
                              const void *iv, size_t ivSz,
                              const void *aad, size_t aadSz,
                              const void *in, void *out, size_t sz,
                              void *tag, size_t tagSz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesGcm_Dev.crypto;
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)crypto->cfg;
    size_t base = crypto->base;
    const uint8_t *ivBytes = (const uint8_t *)iv;
    const uint8_t *aadBytes = (const uint8_t *)aad;
    size_t keySizeBit;
    size_t mode;
    size_t i;
    uint8_t tagBuf[16];
    whal_Error err;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    if (ivSz != 12)
        return WHAL_ENOTSUP;

    if (sz > 0 && (!in || !out))
        return WHAL_EINVAL;

