wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;

    if (!tag || tagSz == 0 || tagSz > 16)
        return WHAL_EINVAL;

    keySizeBit = (keySz == 32) ? 1 : 0;

    /* Init phase */
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk |
                    AES_CR_GCMPH_Msk | AES_CR_NPBLB_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_GCM) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_INIT));

    WriteKey(base, key, keySz);

    whal_Reg_Write(base, AES_IVR3_REG, whal_LoadBe32(ivBytes));
    whal_Reg_Write(base, AES_IVR2_REG, whal_LoadBe32(ivBytes + 4));
    whal_Reg_Write(base, AES_IVR1_REG, whal_LoadBe32(ivBytes + 8));
    whal_Reg_Write(base, AES_IVR0_REG, 0x00000002);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    err = WaitForCCF(base, cfg->timeout);
    if (err)
        goto cleanup;

    /* Header phase (AAD) */
    if (aadSz > 0) {
        whal_Reg_Update(base, AES_CR_REG,
                        AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                        whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                     AES_MODE_ENCRYPT) |
                        whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                     AES_GCMPH_HEADER));

        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

        for (i = 0; i < aadSz; i += 16) {
            const uint8_t *blkAad = aadBytes + i;
            size_t remain = aadSz - i;
            uint8_t block[16] = {0};
            size_t j;

            if (remain >= 16) {
                WriteBlock(base, blkAad);
            } else {
                for (j = 0; j < remain; j++)
                    block[j] = blkAad[j];
                WriteBlock(base, block);
            }

            err = WaitForCCF(base, cfg->timeout);
            if (err)
                goto cleanup;
        }
    }

    /* Payload phase */
    if (sz > 0) {
        mode = (dir == WHAL_CRYPTO_ENCRYPT)
            ? AES_MODE_ENCRYPT : AES_MODE_DECRYPT;

        whal_Reg_Update(base, AES_CR_REG,
                        AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                        whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                     mode) |
                        whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                     AES_GCMPH_PAYLOAD));

        if (aadSz == 0)
            whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

        for (i = 0; i < sz; i += 16) {
            const uint8_t *inBlk = (const uint8_t *)in + i;
            uint8_t *outBlk = (uint8_t *)out + i;
            size_t remain = sz - i;
            uint8_t block[16] = {0};
            size_t j;

            if (remain >= 16) {
                WriteBlock(base, inBlk);
            } else {
                if (mode == AES_MODE_ENCRYPT) {
                    whal_Reg_Update(base, AES_CR_REG, AES_CR_NPBLB_Msk,
                                    whal_SetBits(AES_CR_NPBLB_Msk,
                                                 AES_CR_NPBLB_Pos,
                                                 16 - remain));
                }
                for (j = 0; j < remain; j++)
                    block[j] = inBlk[j];
                WriteBlock(base, block);
            }

            err = WaitForCCF(base, cfg->timeout);
            if (err)
                goto cleanup;

            if (remain >= 16) {
                ReadBlock(base, outBlk);
            } else {
                ReadBlock(base, block);
                for (j = 0; j < remain; j++)
                    outBlk[j] = block[j];
            }
        }
    }

    /* Final phase (tag) */
    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_FINAL));

    if (aadSz == 0 && sz == 0)
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, (uint32_t)(aadSz * 8));
    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, (uint32_t)(sz * 8));

    err = WaitForCCF(base, cfg->timeout);
    if (err)
        goto cleanup;

    ReadBlock(base, tagBuf);

    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

cleanup:
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32wb_AesGcm_Start(whal_AesGcm *dev, whal_Crypto_Dir dir,
                            const void *key, size_t keySz,
                            const void *iv, size_t ivSz,
                            const void *aad, size_t aadSz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesGcm_Dev.crypto;
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)crypto->cfg;
    size_t base = crypto->base;
    const uint8_t *ivBytes = (const uint8_t *)iv;
    const uint8_t *aadBytes = (const uint8_t *)aad;
    size_t keySizeBit;
    size_t mode;
    size_t i;
    whal_Error err;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    if (ivSz != 12)
        return WHAL_ENOTSUP;

