wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
    ZeroKeyIv(base);
    return WHAL_SUCCESS;
}

const whal_AesGcmDriver whal_Stm32wb_Aes_GcmDriver = {
    .Oneshot = whal_Stm32wb_AesGcm_Oneshot,
    .Start = whal_Stm32wb_AesGcm_Start,
    .Process = whal_Stm32wb_AesGcm_Process,
    .Finalize = whal_Stm32wb_AesGcm_Finalize,
};


/* ---- AES-GMAC ---- */

whal_Error whal_Stm32wb_AesGmac_Oneshot(whal_AesGmac *dev,
                               const void *key, size_t keySz,
                               const void *iv, size_t ivSz,
                               const void *aad, size_t aadSz,
                               void *tag, size_t tagSz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesGmac_Dev.crypto;
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)crypto->cfg;
    size_t base = crypto->base;
    const uint8_t *ivBytes = (const uint8_t *)iv;
    const uint8_t *aadBytes = (const uint8_t *)aad;
    size_t keySizeBit;
    size_t i;
    uint8_t tagBuf[16];
    whal_Error err;

    (void)dev;

    if (!key || !iv)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    if (ivSz != 12)
        return WHAL_ENOTSUP;

    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;

    if (!tag || tagSz == 0 || tagSz > 16)
        return WHAL_EINVAL;

    keySizeBit = (keySz == 32) ? 1 : 0;

    /* Init phase */
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk |
                    AES_CR_GCMPH_Msk | AES_CR_NPBLB_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos,
                                 AES_CHMOD_GCM) |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_INIT));

    WriteKey(base, key, keySz);

    whal_Reg_Write(base, AES_IVR3_REG, whal_LoadBe32(ivBytes));
    whal_Reg_Write(base, AES_IVR2_REG, whal_LoadBe32(ivBytes + 4));
    whal_Reg_Write(base, AES_IVR1_REG, whal_LoadBe32(ivBytes + 8));
    whal_Reg_Write(base, AES_IVR0_REG, 0x00000002);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    err = WaitForCCF(base, cfg->timeout);
    if (err)
        goto cleanup;

    /* Header phase (AAD) */
    if (aadSz > 0) {
        whal_Reg_Update(base, AES_CR_REG,
                        AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                        whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                     AES_MODE_ENCRYPT) |
                        whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                     AES_GCMPH_HEADER));

        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

        for (i = 0; i < aadSz; i += 16) {
            const uint8_t *blkAad = aadBytes + i;
            size_t remain = aadSz - i;
            uint8_t block[16] = {0};
            size_t j;

            if (remain >= 16) {
                WriteBlock(base, blkAad);
            } else {
                for (j = 0; j < remain; j++)
                    block[j] = blkAad[j];
                WriteBlock(base, block);
            }

            err = WaitForCCF(base, cfg->timeout);
            if (err)
                goto cleanup;
        }
    }

    /* Final phase (tag) -- no payload for GMAC */
    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_FINAL));

    if (aadSz == 0)
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, (uint32_t)(aadSz * 8));
    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);

    err = WaitForCCF(base, cfg->timeout);
    if (err)
        goto cleanup;

    ReadBlock(base, tagBuf);

    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

cleanup:
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
    ZeroKeyIv(base);
    return err;
}

const whal_AesGmacDriver whal_Stm32wb_Aes_GmacDriver = {
    .Oneshot = whal_Stm32wb_AesGmac_Oneshot,
};


/* ---- AES-CCM ---- */

whal_Error whal_Stm32wb_AesCcm_Oneshot(whal_AesCcm *dev, whal_Crypto_Dir dir,
                              const void *key, size_t keySz,
                              const void *nonce, size_t nonceSz,
                              const void *aad, size_t aadSz,
                              const void *in, void *out, size_t sz,
                              void *tag, size_t tagSz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCcm_Dev.crypto;
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)crypto->cfg;
    size_t base = crypto->base;
    const uint8_t *nonceBytes = (const uint8_t *)nonce;
    const uint8_t *aadBytes = (const uint8_t *)aad;
    size_t keySizeBit;
    size_t mode;
    size_t i;
    uint8_t b0[16];
    uint8_t tagBuf[16];
    whal_Error err;

    (void)dev;

    if (!key || !nonce)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    if (nonceSz < 7 || nonceSz > 13)
        return WHAL_EINVAL;

    if (sz > 0 && (!in || !out))
        return WHAL_EINVAL;

    if (aadSz > 0 && !aad)
        return WHAL_EINVAL;

    if (!tag || tagSz < 4 || tagSz > 16 || (tagSz & 1) != 0)
        return WHAL_EINVAL;

