wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
    keySizeBit = (keySz == 32) ? 1 : 0;

    /* Build B0 */
    {
        size_t q = 15 - nonceSz;
        size_t t = tagSz;
        uint8_t flags = (uint8_t)(((aadSz > 0) ? 0x40 : 0) |
                                  (((t - 2) / 2) << 3) |
                                  (q - 1));
        b0[0] = flags;
        for (i = 0; i < nonceSz; i++)
            b0[1 + i] = nonceBytes[i];

        {
            size_t msgLen = sz;
            size_t j;
            for (j = 0; j < q; j++) {
                b0[15 - j] = (uint8_t)(msgLen & 0xFF);
                msgLen >>= 8;
            }
        }
    }

    /* Init phase */
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);

    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_CHMOD_Msk | AES_CR_CHMOD2_Msk |
                    AES_CR_DATATYPE_Msk | AES_CR_KEYSIZE_Msk |
                    AES_CR_GCMPH_Msk | AES_CR_NPBLB_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_CHMOD_Msk, AES_CR_CHMOD_Pos, 0) |
                    AES_CR_CHMOD2_Msk |
                    whal_SetBits(AES_CR_DATATYPE_Msk, AES_CR_DATATYPE_Pos,
                                 AES_DATATYPE_NONE) |
                    whal_SetBits(AES_CR_KEYSIZE_Msk, AES_CR_KEYSIZE_Pos,
                                 keySizeBit) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_INIT));

    WriteKey(base, key, keySz);
    WriteIv(base, b0);

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    err = WaitForCCF(base, cfg->timeout);
    if (err)
        goto cleanup;

    /* Header phase (AAD) */
    if (aadSz > 0) {
        whal_Reg_Update(base, AES_CR_REG,
                        AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                        whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                     AES_MODE_ENCRYPT) |
                        whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                     AES_GCMPH_HEADER));

        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

        {
            uint8_t hdrBuf[16] = {0};
            size_t hdrOff = 0;
            size_t aadOff = 0;
            size_t j;

            hdrBuf[0] = (uint8_t)(aadSz >> 8);
            hdrBuf[1] = (uint8_t)(aadSz);
            hdrOff = 2;

            while (hdrOff < 16 && aadOff < aadSz) {
                hdrBuf[hdrOff++] = aadBytes[aadOff++];
            }

            WriteBlock(base, hdrBuf);
            err = WaitForCCF(base, cfg->timeout);
            if (err)
                goto cleanup;

            while (aadOff < aadSz) {
                uint8_t block[16] = {0};

                for (j = 0; j < 16 && aadOff < aadSz; j++)
                    block[j] = aadBytes[aadOff++];

                WriteBlock(base, block);
                err = WaitForCCF(base, cfg->timeout);
                if (err)
                    goto cleanup;
            }
        }
    }

    /* Payload phase */
    if (sz > 0) {
        mode = (dir == WHAL_CRYPTO_ENCRYPT)
            ? AES_MODE_ENCRYPT : AES_MODE_DECRYPT;

        whal_Reg_Update(base, AES_CR_REG,
                        AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                        whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                     mode) |
                        whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                     AES_GCMPH_PAYLOAD));

        if (aadSz == 0)
            whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

        for (i = 0; i < sz; i += 16) {
            const uint8_t *inBlk = (const uint8_t *)in + i;
            uint8_t *outBlk = (uint8_t *)out + i;
            size_t remain = sz - i;
            uint8_t block[16] = {0};
            size_t j;

            if (remain >= 16) {
                WriteBlock(base, inBlk);
            } else {
                if (mode == AES_MODE_DECRYPT) {
                    whal_Reg_Update(base, AES_CR_REG, AES_CR_NPBLB_Msk,
                                    whal_SetBits(AES_CR_NPBLB_Msk,
                                                 AES_CR_NPBLB_Pos,
                                                 16 - remain));
                }
                for (j = 0; j < remain; j++)
                    block[j] = inBlk[j];
                WriteBlock(base, block);
            }

            err = WaitForCCF(base, cfg->timeout);
            if (err)
                goto cleanup;

            if (remain >= 16) {
                ReadBlock(base, outBlk);
            } else {
                ReadBlock(base, block);
                for (j = 0; j < remain; j++)
                    outBlk[j] = block[j];
            }
        }
    }

    /* Final phase (tag) */
    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_FINAL));

    if (aadSz == 0 && sz == 0)
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);

    err = WaitForCCF(base, cfg->timeout);
    if (err)
        goto cleanup;

    ReadBlock(base, tagBuf);

    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

cleanup:
    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
    ZeroKeyIv(base);
    return err;
}

whal_Error whal_Stm32wb_AesCcm_Start(whal_AesCcm *dev, whal_Crypto_Dir dir,
                            const void *key, size_t keySz,
                            const void *nonce, size_t nonceSz,
                            const void *aad, size_t aadSz,
                            size_t tagSz, size_t sz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCcm_Dev.crypto;
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)crypto->cfg;
    size_t base = crypto->base;
    const uint8_t *nonceBytes = (const uint8_t *)nonce;
    const uint8_t *aadBytes = (const uint8_t *)aad;
    size_t keySizeBit;
    size_t mode;
    size_t i;
    uint8_t b0[16];
    whal_Error err;

    (void)dev;

    if (!key || !nonce)
        return WHAL_EINVAL;

    if (keySz != 16 && keySz != 32)
        return WHAL_ENOTSUP;

    if (nonceSz < 7 || nonceSz > 13)
        return WHAL_EINVAL;

