wolfSSL/wolfHAL/src/crypto/stm32wb_aes.c
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32wb_AesCcm_Finalize(whal_AesCcm *dev,
                               void *tag, size_t tagSz)
{
    whal_Crypto *crypto = whal_Stm32wb_AesCcm_Dev.crypto;
    const whal_Stm32wb_Aes_Cfg *cfg =
        (const whal_Stm32wb_Aes_Cfg *)crypto->cfg;
    size_t base = crypto->base;
    whal_Stm32wb_AesCcm_State *st =
        (whal_Stm32wb_AesCcm_State *)whal_Stm32wb_AesCcm_Dev.state;
    uint8_t tagBuf[16];
    size_t i;
    whal_Error err;

    (void)dev;

    if (!tag || tagSz < 4 || tagSz > 16 || (tagSz & 1) != 0) {
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
        ZeroKeyIv(base);
        return WHAL_EINVAL;
    }

    /* Final phase (tag) */
    whal_Reg_Update(base, AES_CR_REG,
                    AES_CR_MODE_Msk | AES_CR_GCMPH_Msk,
                    whal_SetBits(AES_CR_MODE_Msk, AES_CR_MODE_Pos,
                                 AES_MODE_ENCRYPT) |
                    whal_SetBits(AES_CR_GCMPH_Msk, AES_CR_GCMPH_Pos,
                                 AES_GCMPH_FINAL));

    if (st->aadSz == 0 && st->dataSz == 0)
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, AES_CR_EN_Msk);

    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);
    whal_Reg_Write(base, AES_DINR_REG, 0);

    err = WaitForCCF(base, cfg->timeout);
    if (err) {
        whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
        ZeroKeyIv(base);
        return err;
    }

    ReadBlock(base, tagBuf);

    for (i = 0; i < tagSz; i++)
        ((uint8_t *)tag)[i] = tagBuf[i];

    whal_Reg_Update(base, AES_CR_REG, AES_CR_EN_Msk, 0);
    ZeroKeyIv(base);
    return WHAL_SUCCESS;
}

const whal_AesCcmDriver whal_Stm32wb_Aes_CcmDriver = {
    .Oneshot = whal_Stm32wb_AesCcm_Oneshot,
    .Start = whal_Stm32wb_AesCcm_Start,
    .Process = whal_Stm32wb_AesCcm_Process,
    .Finalize = whal_Stm32wb_AesCcm_Finalize,
};
